espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG22/Include/efm32pg22_prs_signals.h
/** Asynchronous signals and sources combined and aligned with register bit fields: */
#define PRS_ASYNC_USART0_CS                             (PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 | PRS_ASYNC_CH_CTRL_SIGSEL_USART0CS)
#define PRS_ASYNC_USART0_IRTX                           (PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 | PRS_ASYNC_CH_CTRL_SIGSEL_USART0IRTX)
#define PRS_ASYNC_USART0_RTS                            (PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 | PRS_ASYNC_CH_CTRL_SIGSEL_USART0RTS)
#define PRS_ASYNC_USART0_RXDATA                         (PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 | PRS_ASYNC_CH_CTRL_SIGSEL_USART0RXDATA)
#define PRS_ASYNC_USART0_TX                             (PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 | PRS_ASYNC_CH_CTRL_SIGSEL_USART0TX)
#define PRS_ASYNC_USART0_TXC                            (PRS_ASYNC_CH_CTRL_SOURCESEL_USART0 | PRS_ASYNC_CH_CTRL_SIGSEL_USART0TXC)
#define PRS_ASYNC_USART1_CS                             (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1CS)
#define PRS_ASYNC_USART1_IRTX                           (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1IRTX)
#define PRS_ASYNC_USART1_RTS                            (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1RTS)
#define PRS_ASYNC_USART1_RXDATA                         (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1RXDATA)
#define PRS_ASYNC_USART1_TX                             (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1TX)
#define PRS_ASYNC_USART1_TXC                            (PRS_ASYNC_CH_CTRL_SOURCESEL_USART1 | PRS_ASYNC_CH_CTRL_SIGSEL_USART1TXC)
#define PRS_ASYNC_TIMER0_UF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER0UF)
#define PRS_ASYNC_TIMER0_OF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER0OF)
#define PRS_ASYNC_TIMER0_CC0                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER0CC0)
#define PRS_ASYNC_TIMER0_CC1                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER0CC1)
#define PRS_ASYNC_TIMER0_CC2                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER0CC2)
#define PRS_ASYNC_TIMER1_UF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER1UF)
#define PRS_ASYNC_TIMER1_OF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER1OF)
#define PRS_ASYNC_TIMER1_CC0                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER1CC0)
#define PRS_ASYNC_TIMER1_CC1                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER1CC1)
#define PRS_ASYNC_TIMER1_CC2                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER1 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER1CC2)
#define PRS_ASYNC_IADC0_SCANENTRYDONE                   (PRS_ASYNC_CH_CTRL_SOURCESEL_IADC0 | PRS_ASYNC_CH_CTRL_SIGSEL_IADC0SCANENTRYDONE)
#define PRS_ASYNC_IADC0_SCANTABLEDONE                   (PRS_ASYNC_CH_CTRL_SOURCESEL_IADC0 | PRS_ASYNC_CH_CTRL_SIGSEL_IADC0SCANTABLEDONE)
#define PRS_ASYNC_IADC0_SINGLEDONE                      (PRS_ASYNC_CH_CTRL_SOURCESEL_IADC0 | PRS_ASYNC_CH_CTRL_SIGSEL_IADC0SINGLEDONE)
#define PRS_ASYNC_LETIMER0_CH0                          (PRS_ASYNC_CH_CTRL_SOURCESEL_LETIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_LETIMER0CH0)
#define PRS_ASYNC_LETIMER0_CH1                          (PRS_ASYNC_CH_CTRL_SOURCESEL_LETIMER0 | PRS_ASYNC_CH_CTRL_SIGSEL_LETIMER0CH1)
#define PRS_ASYNC_RTCC_CCV0                             (PRS_ASYNC_CH_CTRL_SOURCESEL_RTCC | PRS_ASYNC_CH_CTRL_SIGSEL_RTCCCCV0)
#define PRS_ASYNC_RTCC_CCV1                             (PRS_ASYNC_CH_CTRL_SOURCESEL_RTCC | PRS_ASYNC_CH_CTRL_SIGSEL_RTCCCCV1)
#define PRS_ASYNC_RTCC_CCV2                             (PRS_ASYNC_CH_CTRL_SOURCESEL_RTCC | PRS_ASYNC_CH_CTRL_SIGSEL_RTCCCCV2)
#define PRS_ASYNC_BURTC_COMP                            (PRS_ASYNC_CH_CTRL_SOURCESEL_BURTC | PRS_ASYNC_CH_CTRL_SIGSEL_BURTCCOMP)
#define PRS_ASYNC_BURTC_OVERFLOW                        (PRS_ASYNC_CH_CTRL_SOURCESEL_BURTC | PRS_ASYNC_CH_CTRL_SIGSEL_BURTCOVERFLOW)
#define PRS_ASYNC_GPIO_PIN0                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN0)
#define PRS_ASYNC_GPIO_PIN1                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN1)
#define PRS_ASYNC_GPIO_PIN2                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN2)
#define PRS_ASYNC_GPIO_PIN3                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN3)
#define PRS_ASYNC_GPIO_PIN4                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN4)
#define PRS_ASYNC_GPIO_PIN5                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN5)
#define PRS_ASYNC_GPIO_PIN6                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN6)
#define PRS_ASYNC_GPIO_PIN7                             (PRS_ASYNC_CH_CTRL_SOURCESEL_GPIO | PRS_ASYNC_CH_CTRL_SIGSEL_GPIOPIN7)
#define PRS_ASYNC_TIMER2_UF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER2UF)
#define PRS_ASYNC_TIMER2_OF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER2OF)
#define PRS_ASYNC_TIMER2_CC0                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER2CC0)
#define PRS_ASYNC_TIMER2_CC1                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER2CC1)
#define PRS_ASYNC_TIMER2_CC2                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER2 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER2CC2)
#define PRS_ASYNC_TIMER3_UF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER3UF)
#define PRS_ASYNC_TIMER3_OF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER3OF)
#define PRS_ASYNC_TIMER3_CC0                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER3CC0)
#define PRS_ASYNC_TIMER3_CC1                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER3CC1)
#define PRS_ASYNC_TIMER3_CC2                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER3 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER3CC2)
#define PRS_ASYNC_CORE_CTIOUT0                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CORE | PRS_ASYNC_CH_CTRL_SIGSEL_CORECTIOUT0)
#define PRS_ASYNC_CORE_CTIOUT1                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CORE | PRS_ASYNC_CH_CTRL_SIGSEL_CORECTIOUT1)
#define PRS_ASYNC_CORE_CTIOUT2                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CORE | PRS_ASYNC_CH_CTRL_SIGSEL_CORECTIOUT2)
#define PRS_ASYNC_CORE_CTIOUT3                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CORE | PRS_ASYNC_CH_CTRL_SIGSEL_CORECTIOUT3)
#define PRS_ASYNC_CMUL_CLKOUT0                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CMUL | PRS_ASYNC_CH_CTRL_SIGSEL_CMULCLKOUT0)
#define PRS_ASYNC_CMUL_CLKOUT1                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CMUL | PRS_ASYNC_CH_CTRL_SIGSEL_CMULCLKOUT1)
#define PRS_ASYNC_CMUL_CLKOUT2                          (PRS_ASYNC_CH_CTRL_SOURCESEL_CMUL | PRS_ASYNC_CH_CTRL_SIGSEL_CMULCLKOUT2)
#define PRS_ASYNC_PRSL_ASYNCH0                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH0)
#define PRS_ASYNC_PRSL_ASYNCH1                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH1)
#define PRS_ASYNC_PRSL_ASYNCH2                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH2)
#define PRS_ASYNC_PRSL_ASYNCH3                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH3)
#define PRS_ASYNC_PRSL_ASYNCH4                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH4)
#define PRS_ASYNC_PRSL_ASYNCH5                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH5)
#define PRS_ASYNC_PRSL_ASYNCH6                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH6)
#define PRS_ASYNC_PRSL_ASYNCH7                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRSL | PRS_ASYNC_CH_CTRL_SIGSEL_PRSLASYNCH7)
#define PRS_ASYNC_PRS_ASYNCH8                           (PRS_ASYNC_CH_CTRL_SOURCESEL_PRS | PRS_ASYNC_CH_CTRL_SIGSEL_PRSASYNCH8)
#define PRS_ASYNC_PRS_ASYNCH9                           (PRS_ASYNC_CH_CTRL_SOURCESEL_PRS | PRS_ASYNC_CH_CTRL_SIGSEL_PRSASYNCH9)
#define PRS_ASYNC_PRS_ASYNCH10                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRS | PRS_ASYNC_CH_CTRL_SIGSEL_PRSASYNCH10)
#define PRS_ASYNC_PRS_ASYNCH11                          (PRS_ASYNC_CH_CTRL_SOURCESEL_PRS | PRS_ASYNC_CH_CTRL_SIGSEL_PRSASYNCH11)
#define PRS_ASYNC_PDML_PDMDSRPULSE                      (PRS_ASYNC_CH_CTRL_SOURCESEL_PDML | PRS_ASYNC_CH_CTRL_SIGSEL_PDMLPDMDSRPULSE)
#define PRS_ASYNC_EUART0_IRDATX                         (PRS_ASYNC_CH_CTRL_SOURCESEL_EUART0 | PRS_ASYNC_CH_CTRL_SIGSEL_EUART0IRDATX)
#define PRS_ASYNC_EUART0_RTS                            (PRS_ASYNC_CH_CTRL_SOURCESEL_EUART0 | PRS_ASYNC_CH_CTRL_SIGSEL_EUART0RTS)
#define PRS_ASYNC_EUART0_TX                             (PRS_ASYNC_CH_CTRL_SOURCESEL_EUART0 | PRS_ASYNC_CH_CTRL_SIGSEL_EUART0TX)
#define PRS_ASYNC_EUART0_TXC                            (PRS_ASYNC_CH_CTRL_SOURCESEL_EUART0 | PRS_ASYNC_CH_CTRL_SIGSEL_EUART0TXC)
#define PRS_ASYNC_EUART0_RXFL                           (PRS_ASYNC_CH_CTRL_SOURCESEL_EUART0 | PRS_ASYNC_CH_CTRL_SIGSEL_EUART0RXFL)
#define PRS_ASYNC_TIMER4_UF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER4UF)
#define PRS_ASYNC_TIMER4_OF                             (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER4OF)
#define PRS_ASYNC_TIMER4_CC0                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER4CC0)
#define PRS_ASYNC_TIMER4_CC1                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER4CC1)
#define PRS_ASYNC_TIMER4_CC2                            (PRS_ASYNC_CH_CTRL_SOURCESEL_TIMER4 | PRS_ASYNC_CH_CTRL_SIGSEL_TIMER4CC2)
#define PRS_ASYNC_LFRCO_CALMEAS                         (PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO | PRS_ASYNC_CH_CTRL_SIGSEL_LFRCOCALMEAS)
#define PRS_ASYNC_LFRCO_SDM                             (PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO | PRS_ASYNC_CH_CTRL_SIGSEL_LFRCOSDM)
#define PRS_ASYNC_LFRCO_TCMEAS                          (PRS_ASYNC_CH_CTRL_SOURCESEL_LFRCO | PRS_ASYNC_CH_CTRL_SIGSEL_LFRCOTCMEAS)

/**
 * Asynchronous signals and sources combined and aligned with register bit fields
 * without the '_ASYNCH_' infix in order for backward compatibility:
 */
#define PRS_USART0_CS                                   (PRS_ASYNC_USART0_CS)
#define PRS_USART0_IRTX                                 (PRS_ASYNC_USART0_IRTX)
#define PRS_USART0_RTS                                  (PRS_ASYNC_USART0_RTS)
#define PRS_USART0_RXDATA                               (PRS_ASYNC_USART0_RXDATA)
#define PRS_USART0_TX                                   (PRS_ASYNC_USART0_TX)
#define PRS_USART0_TXC                                  (PRS_ASYNC_USART0_TXC)
#define PRS_USART1_CS                                   (PRS_ASYNC_USART1_CS)
#define PRS_USART1_IRTX                                 (PRS_ASYNC_USART1_IRTX)
#define PRS_USART1_RTS                                  (PRS_ASYNC_USART1_RTS)
#define PRS_USART1_RXDATA                               (PRS_ASYNC_USART1_RXDATA)
#define PRS_USART1_TX                                   (PRS_ASYNC_USART1_TX)
#define PRS_USART1_TXC                                  (PRS_ASYNC_USART1_TXC)
#define PRS_TIMER0_UF                                   (PRS_ASYNC_TIMER0_UF)
#define PRS_TIMER0_OF                                   (PRS_ASYNC_TIMER0_OF)
#define PRS_TIMER0_CC0                                  (PRS_ASYNC_TIMER0_CC0)
#define PRS_TIMER0_CC1                                  (PRS_ASYNC_TIMER0_CC1)
#define PRS_TIMER0_CC2                                  (PRS_ASYNC_TIMER0_CC2)
#define PRS_TIMER1_UF                                   (PRS_ASYNC_TIMER1_UF)
#define PRS_TIMER1_OF                                   (PRS_ASYNC_TIMER1_OF)
#define PRS_TIMER1_CC0                                  (PRS_ASYNC_TIMER1_CC0)
#define PRS_TIMER1_CC1                                  (PRS_ASYNC_TIMER1_CC1)
#define PRS_TIMER1_CC2                                  (PRS_ASYNC_TIMER1_CC2)
#define PRS_IADC0_SCANENTRYDONE                         (PRS_ASYNC_IADC0_SCANENTRYDONE)
#define PRS_IADC0_SCANTABLEDONE                         (PRS_ASYNC_IADC0_SCANTABLEDONE)
#define PRS_IADC0_SINGLEDONE                            (PRS_ASYNC_IADC0_SINGLEDONE)
#define PRS_LETIMER0_CH0                                (PRS_ASYNC_LETIMER0_CH0)
#define PRS_LETIMER0_CH1                                (PRS_ASYNC_LETIMER0_CH1)
#define PRS_RTCC_CCV0                                   (PRS_ASYNC_RTCC_CCV0)
#define PRS_RTCC_CCV1                                   (PRS_ASYNC_RTCC_CCV1)
#define PRS_RTCC_CCV2                                   (PRS_ASYNC_RTCC_CCV2)
#define PRS_BURTC_COMP                                  (PRS_ASYNC_BURTC_COMP)
#define PRS_BURTC_OVERFLOW                              (PRS_ASYNC_BURTC_OVERFLOW)
#define PRS_GPIO_PIN0                                   (PRS_ASYNC_GPIO_PIN0)
#define PRS_GPIO_PIN1                                   (PRS_ASYNC_GPIO_PIN1)
#define PRS_GPIO_PIN2                                   (PRS_ASYNC_GPIO_PIN2)
#define PRS_GPIO_PIN3                                   (PRS_ASYNC_GPIO_PIN3)
#define PRS_GPIO_PIN4                                   (PRS_ASYNC_GPIO_PIN4)
#define PRS_GPIO_PIN5                                   (PRS_ASYNC_GPIO_PIN5)
#define PRS_GPIO_PIN6                                   (PRS_ASYNC_GPIO_PIN6)
#define PRS_GPIO_PIN7                                   (PRS_ASYNC_GPIO_PIN7)
#define PRS_TIMER2_UF                                   (PRS_ASYNC_TIMER2_UF)
#define PRS_TIMER2_OF                                   (PRS_ASYNC_TIMER2_OF)
#define PRS_TIMER2_CC0                                  (PRS_ASYNC_TIMER2_CC0)
#define PRS_TIMER2_CC1                                  (PRS_ASYNC_TIMER2_CC1)
#define PRS_TIMER2_CC2                                  (PRS_ASYNC_TIMER2_CC2)
#define PRS_TIMER3_UF                                   (PRS_ASYNC_TIMER3_UF)
#define PRS_TIMER3_OF                                   (PRS_ASYNC_TIMER3_OF)
#define PRS_TIMER3_CC0                                  (PRS_ASYNC_TIMER3_CC0)
#define PRS_TIMER3_CC1                                  (PRS_ASYNC_TIMER3_CC1)
#define PRS_TIMER3_CC2                                  (PRS_ASYNC_TIMER3_CC2)
#define PRS_CORE_CTIOUT0                                (PRS_ASYNC_CORE_CTIOUT0)
#define PRS_CORE_CTIOUT1                                (PRS_ASYNC_CORE_CTIOUT1)
#define PRS_CORE_CTIOUT2                                (PRS_ASYNC_CORE_CTIOUT2)
#define PRS_CORE_CTIOUT3                                (PRS_ASYNC_CORE_CTIOUT3)
#define PRS_CMUL_CLKOUT0                                (PRS_ASYNC_CMUL_CLKOUT0)
#define PRS_CMUL_CLKOUT1                                (PRS_ASYNC_CMUL_CLKOUT1)
#define PRS_CMUL_CLKOUT2                                (PRS_ASYNC_CMUL_CLKOUT2)
#define PRS_PRSL_ASYNCH0                                (PRS_ASYNC_PRSL_ASYNCH0)
#define PRS_PRSL_ASYNCH1                                (PRS_ASYNC_PRSL_ASYNCH1)
#define PRS_PRSL_ASYNCH2                                (PRS_ASYNC_PRSL_ASYNCH2)
#define PRS_PRSL_ASYNCH3                                (PRS_ASYNC_PRSL_ASYNCH3)
#define PRS_PRSL_ASYNCH4                                (PRS_ASYNC_PRSL_ASYNCH4)
#define PRS_PRSL_ASYNCH5                                (PRS_ASYNC_PRSL_ASYNCH5)
#define PRS_PRSL_ASYNCH6                                (PRS_ASYNC_PRSL_ASYNCH6)
#define PRS_PRSL_ASYNCH7                                (PRS_ASYNC_PRSL_ASYNCH7)
#define PRS_PRS_ASYNCH8                                 (PRS_ASYNC_PRS_ASYNCH8)
#define PRS_PRS_ASYNCH9                                 (PRS_ASYNC_PRS_ASYNCH9)
#define PRS_PRS_ASYNCH10                                (PRS_ASYNC_PRS_ASYNCH10)
#define PRS_PRS_ASYNCH11                                (PRS_ASYNC_PRS_ASYNCH11)
#define PRS_PDML_PDMDSRPULSE                            (PRS_ASYNC_PDML_PDMDSRPULSE)
#define PRS_EUART0_IRDATX                               (PRS_ASYNC_EUART0_IRDATX)
#define PRS_EUART0_RTS                                  (PRS_ASYNC_EUART0_RTS)
#define PRS_EUART0_TX                                   (PRS_ASYNC_EUART0_TX)
#define PRS_EUART0_TXC                                  (PRS_ASYNC_EUART0_TXC)
#define PRS_EUART0_RXFL                                 (PRS_ASYNC_EUART0_RXFL)
#define PRS_TIMER4_UF                                   (PRS_ASYNC_TIMER4_UF)
#define PRS_TIMER4_OF                                   (PRS_ASYNC_TIMER4_OF)
#define PRS_TIMER4_CC0                                  (PRS_ASYNC_TIMER4_CC0)
#define PRS_TIMER4_CC1                                  (PRS_ASYNC_TIMER4_CC1)
#define PRS_TIMER4_CC2                                  (PRS_ASYNC_TIMER4_CC2)
#define PRS_LFRCO_CALMEAS                               (PRS_ASYNC_LFRCO_CALMEAS)
#define PRS_LFRCO_SDM                                   (PRS_ASYNC_LFRCO_SDM)
#define PRS_LFRCO_TCMEAS                                (PRS_ASYNC_LFRCO_TCMEAS)

#endif /* EFM32PG22_PRS_SIGNALS_H */
